CS/C++/C++.org
#+SETUPFILE: ../../configOrg/level2.org
#+OPTIONS: H:2 toc:2 num:3 ^:nil
#+TITLES: C++
#+AUTHORs: weiwu
#+begin_src c++

#+end_src


*C++ Premier Plus*

* C++ Basics


** Variables, Operators and Expressions

*** naming


*** logic operation
- --i and i--.
//--i will decrements the value of i, and then return the decremented value.
//i-- will return the value of i, then decrements the value of i.
- logical and arithmetic shift.

*** scientific output expression
- use “%10.1f” as format specifier.
*** A global variable is declared at file scope.
*** External Variables
To declare the variable but don’t allocate memory for it (just a placeholder) we have to use the keyword extern which specifies that the variable is defined in another source file.
*** static global variables
It is often preferable to have a global variable in one source file but this global variable should not be accessible by any other source file. Use the static specifier to bound its use to the current source file.

*** register variables
- Request for variable to be placed in register
  - register int a;
- Access to register variable is faster
- Not always granted

** preprocessor
*** l Preprocessor directives start with ‘#’ e.g.:
#+BEGIN_SRC c
#include
#define
#+END_SRC
- The directive:
#include "filename"

causes the file to be searched first in the directory of the original source file. The include directive
can be used to handle compiler dependencies.

#include <filename>

causes the preprocessor to search for a file in a defined sequence of standard places (the include
directory).
*** Preprocessor looks for ‘#’
** Typedef
- Use typedef for substitution
#+BEGIN_SRC c
typedef long int INT32;

#+END_SRC
