docs/CS/C++/C++.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-09-27 Thu 22:08 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="weiwu" />
<link rel="stylesheet" type="text/css" href="../../styles/demo/css/demo.css"/>
<link href="https://fonts.proxy.ustclug.org/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline14">1. C++ Basics</a>
<ul>
<li><a href="#orgheadline8">1.1. Variables, Operators and Expressions</a></li>
<li><a href="#orgheadline11">1.2. preprocessor</a></li>
<li><a href="#orgheadline12">1.3. Typedef</a></li>
<li><a href="#orgheadline13">1.4. Macros</a></li>
</ul>
</li>
<li><a href="#orgheadline19">2. GETTING STARTED</a>
<ul>
<li><a href="#orgheadline15">2.1. Learning C++: What Lies Before You</a></li>
<li><a href="#orgheadline16">2.2. The Origins of C++: A Little History</a></li>
<li><a href="#orgheadline17">2.3. Portability and Standards</a></li>
<li><a href="#orgheadline18">2.4. The Mechanics of Creating a Program</a></li>
</ul>
</li>
<li><a href="#orgheadline25">3. SETTING OUT TO C++</a>
<ul>
<li><a href="#orgheadline20">3.1. C++ Initiation</a></li>
<li><a href="#orgheadline22">3.2. C++ Statements</a></li>
<li><a href="#orgheadline23">3.3. More C++ Statements</a></li>
<li><a href="#orgheadline24">3.4. Functions</a></li>
</ul>
</li>
<li><a href="#orgheadline37">4. DEALING WITH DATA</a>
<ul>
<li><a href="#orgheadline33">4.1. Simple Variables</a></li>
<li><a href="#orgheadline34">4.2. The const Qualifier</a></li>
<li><a href="#orgheadline35">4.3. Floating-Point Numbers</a></li>
<li><a href="#orgheadline36">4.4. C++ Arithmetic Operators</a></li>
</ul>
</li>
<li><a href="#orgheadline52">5. COMPOUND TYPES</a>
<ul>
<li><a href="#orgheadline38">5.1. Introducing Arrays</a></li>
<li><a href="#orgheadline39">5.2. Strings</a></li>
<li><a href="#orgheadline40">5.3. Introducing the string Class</a></li>
<li><a href="#orgheadline43">5.4. Introducing Structures</a></li>
<li><a href="#orgheadline44">5.5. Unions</a></li>
<li><a href="#orgheadline45">5.6. Enumerations</a></li>
<li><a href="#orgheadline47">5.7. Pointers and the Free Store</a></li>
<li><a href="#orgheadline51">5.8. Pointers, Arrays, and Pointer Arithmetic</a></li>
</ul>
</li>
<li><a href="#orgheadline68">6. LOOPS AND RELATIONAL EXPRESSIONS</a>
<ul>
<li><a href="#orgheadline53">6.1. Introducing for Loops</a></li>
<li><a href="#orgheadline54">6.2. Relational Expressions</a></li>
<li><a href="#orgheadline55">6.3. The while Loop</a></li>
<li><a href="#orgheadline56">6.4. The do while Loop</a></li>
<li><a href="#orgheadline57">6.5. Loops and Text Input</a></li>
<li><a href="#orgheadline58">6.6. Nested Loops and Two-Dimensional Arrays</a></li>
<li><a href="#orgheadline59">6.7. The compound or block statement</a></li>
<li><a href="#orgheadline61">6.8. The if statement</a></li>
<li><a href="#orgheadline62">6.9. The for loop</a></li>
<li><a href="#orgheadline63">6.10. The while loop</a></li>
<li><a href="#orgheadline64">6.11. The do-while loop</a></li>
<li><a href="#orgheadline65">6.12. Break and continue statements</a></li>
<li><a href="#orgheadline66">6.13. Multiple choices, the switch statement</a></li>
<li><a href="#orgheadline67">6.14. Goto and labels</a></li>
</ul>
</li>
<li><a href="#orgheadline77">7. BRANCHING STATEMENTS AND LOGICAL OPERATORS</a>
<ul>
<li><a href="#orgheadline69">7.1. The if Statement</a></li>
<li><a href="#orgheadline70">7.2. Logical Expressions</a></li>
<li><a href="#orgheadline71">7.3. The cctype Library of Character Functions</a></li>
<li><a href="#orgheadline72">7.4. The ?: Operator</a></li>
<li><a href="#orgheadline73">7.5. The switch Statement</a></li>
<li><a href="#orgheadline74">7.6. The break and continue Statements</a></li>
<li><a href="#orgheadline75">7.7. Number-Reading Loops</a></li>
<li><a href="#orgheadline76">7.8. Simple File Input/Output</a></li>
</ul>
</li>
<li><a href="#orgheadline88">8. FUNCTIONS: C++’S PROGRAMMING MODULES</a>
<ul>
<li><a href="#orgheadline79">8.1. Function Review</a></li>
<li><a href="#orgheadline80">8.2. Function Arguments and Passing by Value</a></li>
<li><a href="#orgheadline81">8.3. Functions and Arrays</a></li>
<li><a href="#orgheadline82">8.4. Functions and Two-Dimensional Arrays</a></li>
<li><a href="#orgheadline83">8.5. Functions and C-Style Strings</a></li>
<li><a href="#orgheadline84">8.6. Functions and Structures</a></li>
<li><a href="#orgheadline85">8.7. Functions and string Class Objects</a></li>
<li><a href="#orgheadline86">8.8. Recursion</a></li>
<li><a href="#orgheadline87">8.9. Pointers to Functions</a></li>
</ul>
</li>
<li><a href="#orgheadline94">9. ADVENTURES IN FUNCTIONS</a>
<ul>
<li><a href="#orgheadline89">9.1. C++ Inline Functions</a></li>
<li><a href="#orgheadline90">9.2. Reference Variables</a></li>
<li><a href="#orgheadline91">9.3. Default Arguments</a></li>
<li><a href="#orgheadline92">9.4. Function Overloading</a></li>
<li><a href="#orgheadline93">9.5. Function Templates</a></li>
</ul>
</li>
<li><a href="#orgheadline101">10. MEMORY MODELS AND NAMESPACES</a>
<ul>
<li><a href="#orgheadline97">10.1. Separate Compilation</a></li>
<li><a href="#orgheadline98">10.2. Storage Duration, Scope, and Linkage</a></li>
<li><a href="#orgheadline99">10.3. The Placement new Operator</a></li>
<li><a href="#orgheadline100">10.4. Namespaces</a></li>
</ul>
</li>
<li><a href="#orgheadline112">11. OBJECTS AND CLASSES</a>
<ul>
<li><a href="#orgheadline103">11.1. Procedural and Object-Oriented Programming</a></li>
<li><a href="#orgheadline105">11.2. Abstraction and Classes</a></li>
<li><a href="#orgheadline106">11.3. Class Constructors and Destructors</a></li>
<li><a href="#orgheadline107">11.4. Knowing Your Objects: The this Pointer</a></li>
<li><a href="#orgheadline108">11.5. An Array of Objects</a></li>
<li><a href="#orgheadline109">11.6. The Interface and Implementation Revisited</a></li>
<li><a href="#orgheadline110">11.7. Class Scope</a></li>
<li><a href="#orgheadline111">11.8. Abstract Data Types</a></li>
</ul>
</li>
<li><a href="#orgheadline126">12. WORKING WITH CLASSES</a>
<ul>
<li><a href="#orgheadline113">12.1. Operator Overloading</a></li>
<li><a href="#orgheadline121">12.2. Time on Our Hands: Developing an Operator Overloading Example</a></li>
<li><a href="#orgheadline122">12.3. Introducing Friends</a></li>
<li><a href="#orgheadline123">12.4. Overloaded Operators: Member Versus Nonmember Functions</a></li>
<li><a href="#orgheadline124">12.5. More Overloading: A Vector Class</a></li>
<li><a href="#orgheadline125">12.6. Automatic Conversions and Type Casts for Classes</a></li>
</ul>
</li>
<li><a href="#orgheadline129">13. CLASSES AND DYNAMIC MEMORY ALLOCATION</a>
<ul>
<li><a href="#orgheadline127">13.1. Dynamic Memory and Classes</a></li>
<li><a href="#orgheadline128">13.2. A Queue Simulation</a></li>
</ul>
</li>
<li><a href="#orgheadline137">14. CLASS INHERITANCE</a>
<ul>
<li><a href="#orgheadline130">14.1. Beginning with a Simple Base Class</a></li>
<li><a href="#orgheadline131">14.2. Inheritance: An Is-a Relationship</a></li>
<li><a href="#orgheadline132">14.3. Polymorphic Public Inheritance</a></li>
<li><a href="#orgheadline133">14.4. Access Control: protected</a></li>
<li><a href="#orgheadline134">14.5. Abstract Base Classes</a></li>
<li><a href="#orgheadline135">14.6. Inheritance and Dynamic Memory Allocation</a></li>
<li><a href="#orgheadline136">14.7. Class Design Review</a></li>
</ul>
</li>
<li><a href="#orgheadline142">15. REUSING CODE IN C++</a>
<ul>
<li><a href="#orgheadline138">15.1. Classes with Object Members</a></li>
<li><a href="#orgheadline139">15.2. Private Inheritance</a></li>
<li><a href="#orgheadline140">15.3. Multiple Inheritance</a></li>
<li><a href="#orgheadline141">15.4. Class Templates</a></li>
</ul>
</li>
<li><a href="#orgheadline148">16. FRIENDS, EXCEPTIONS, AND MORE</a>
<ul>
<li><a href="#orgheadline143">16.1. Friends</a></li>
<li><a href="#orgheadline144">16.2. Nested Classes</a></li>
<li><a href="#orgheadline145">16.3. Exceptions</a></li>
<li><a href="#orgheadline146">16.4. RTTI</a></li>
<li><a href="#orgheadline147">16.5. Type Cast Operators</a></li>
</ul>
</li>
<li><a href="#orgheadline157">17. THE string CLASS AND THE STANDARD TEMPLATE LIBRARY</a>
<ul>
<li><a href="#orgheadline149">17.1. The string Class</a></li>
<li><a href="#orgheadline150">17.2. The auto_ptr Class</a></li>
<li><a href="#orgheadline152">17.3. The STL</a></li>
<li><a href="#orgheadline153">17.4. Generic Programming</a></li>
<li><a href="#orgheadline154">17.5. Function Objects (aka Functors)</a></li>
<li><a href="#orgheadline155">17.6. Algorithms</a></li>
<li><a href="#orgheadline156">17.7. Other Libraries</a></li>
</ul>
</li>
<li><a href="#orgheadline165">18. INPUT, OUTPUT, AND FILES</a>
<ul>
<li><a href="#orgheadline159">18.1. An Overview of C++ Input and Output</a></li>
<li><a href="#orgheadline160">18.2. Output with cout</a></li>
<li><a href="#orgheadline161">18.3. Input with cin</a></li>
<li><a href="#orgheadline162">18.4. File Input and Output</a></li>
<li><a href="#orgheadline163">18.5. Incore Formatting</a></li>
<li><a href="#orgheadline164">18.6. What Now?</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div class="org-src-container">

<pre class="src src-c++"></pre>
</div>


<p>
<b>C++ Premier Plus</b>
</p>

<div id="outline-container-orgheadline14" class="outline-2">
<h2 id="orgheadline14"><span class="section-number-2">1</span> C++ Basics</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">1.1</span> Variables, Operators and Expressions</h3>
<div class="outline-text-3" id="text-1-1">
</div><ol class="org-ol"><li><a id="orgheadline1"></a>naming<br  /></li>


<li><a id="orgheadline2"></a>logic operation<br  /><div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>&#x2013;i and i&#x2013;.</li>
</ul>
<p>
//&#x2013;i will decrements the value of i, and then return the decremented value.
//i&#x2013; will return the value of i, then decrements the value of i.
</p>
<ul class="org-ul">
<li>logical and arithmetic shift.</li>
</ul>
</div></li>

<li><a id="orgheadline3"></a>scientific output expression<br  /><div class="outline-text-4" id="text-1-1-3">
<ul class="org-ul">
<li>use “%10.1f” as format specifier.</li>
</ul>
</div></li>
<li><a id="orgheadline4"></a>A global variable is declared at file scope.<br  /></li>
<li><a id="orgheadline5"></a>External Variables<br  /><div class="outline-text-4" id="text-1-1-5">
<p>
To declare the variable but don’t allocate memory for it (just a placeholder) we have to use the keyword extern which specifies that the variable is defined in another source file.
</p>
</div></li>
<li><a id="orgheadline6"></a>static global variables<br  /><div class="outline-text-4" id="text-1-1-6">
<p>
It is often preferable to have a global variable in one source file but this global variable should not be accessible by any other source file. Use the static specifier to bound its use to the current source file.
</p>
</div></li>

<li><a id="orgheadline7"></a>register variables<br  /><div class="outline-text-4" id="text-1-1-7">
<ul class="org-ul">
<li>Request for variable to be placed in register
<ul class="org-ul">
<li>register int a;</li>
</ul></li>
<li>Access to register variable is faster</li>
<li>Not always granted</li>
</ul>
</div></li></ol>
</div>

<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">1.2</span> preprocessor</h3>
<div class="outline-text-3" id="text-1-2">
</div><ol class="org-ol"><li><a id="orgheadline9"></a>l Preprocessor directives start with ‘#’ e.g.:<br  /><div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #F92672;">#include</span>
<span style="color: #F92672;">#define</span>
</pre>
</div>
<ul class="org-ul">
<li>The directive:</li>
</ul>
<p>
#include "filename"
</p>

<p>
causes the file to be searched first in the directory of the original source file. The include directive
can be used to handle compiler dependencies.
</p>

<p>
#include &lt;filename&gt;
</p>

<p>
causes the preprocessor to search for a file in a defined sequence of standard places (the include
directory).
</p>
</div></li>
<li><a id="orgheadline10"></a>Preprocessor looks for ‘#’<br  /></li></ol>
</div>
<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">1.3</span> Typedef</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Use typedef for substitution</li>
</ul>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #F92672;">typedef</span> <span style="color: #66D9EF;">long</span> <span style="color: #66D9EF;">int</span> <span style="color: #66D9EF;">INT32</span>;
</pre>
</div>
</div>
</div>
