CS/C++/C++.org
** Macros
- For global magic numbers
#+BEGIN_SRC c
#define MAX 256

#+END_SRC
- Macros with arguments (not a function)
#+BEGIN_SRC c
#define sqr(x) ((x) * (x))

#+END_SRC
* GETTING STARTED
** Learning C++: What Lies Before You
** The Origins of C++: A Little History
** Portability and Standards
** The Mechanics of Creating a Program

* SETTING OUT TO C++
** C++ Initiation
** C++ Statements
*** Comments
- //
- /* */
** More C++ Statements
** Functions



* DEALING WITH DATA
** Simple Variables
*** Variables:

**** common variables names
#+begin_src c++
int price_count_reader;    // No abbreviation.
int num_errors;            // "num" is a widespread convention.
int num_dns_connections;   // Most people know what "DNS" stands for.
#+end_src

**** Class Data Members
Data members of classes, both static and non-static, are named like ordinary nonmember variables, but with a trailing underscore.
#+begin_src c++
class TableInfo {
  ...
 private:
  string table_name_;  // OK - underscore at end.
  string tablename_;   // OK.
  static Pool<TableInfo>* pool_;  // OK.
};
#+end_src

*** Constant Names
Variables declared constexpr or const, and whose value is fixed for the duration of the program, are named with a leading "k" followed by mixed case. For example:
#+begin_src c++
const int kDaysInAWeek = 7;
#+end_src

*** Const Member Functions
Making an object const makessure that only so called 'const' member functions can be called for the const object.
#+BEGIN_SRC cpp
const Date dt; // Const date object
const Point pt; // Const point object
#+END_SRC
Const member functions are functions that do not change the state of the object. Typical examples of const member functions are accessing or selector functions.
#+BEGIN_SRC cpp
class Date
{public:
int ret_day() const; // Constant member function
int ret_month() const; // Constant member function
};
class Point
{public:
double ret_x() const;
Point add(const Point& pt) const;
};
#+END_SRC
So there are three possibilities for the const keyword:
- const arguments; const relates to argument
- const member function; const relates to state of object
- const return types; the return type cannot be changed by the caller
*** Function Names
#+begin_src c++ :tangle yes
AddTableEntry()
DeleteUrl()
OpenFileOrDie()
#+end_src

*** File Names
- my_useful_class.cc
- my-useful-class.cc
- myusefulclass.cc
- myusefulclass_test.cc // _unittest and _regtest are deprecated.
** The const Qualifier
** Floating-Point Numbers
** C++ Arithmetic Operators



* COMPOUND TYPES
