docs/CS/C++/C++.html
<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="section-number-3">1.4</span> Macros</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>For global magic numbers</li>
</ul>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #F92672;">#define</span> <span style="color: #FD971F;">MAX</span> <span style="color: #AE81FF;">256</span>
</pre>
</div>
<ul class="org-ul">
<li>Macros with arguments (not a function)</li>
</ul>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #F92672;">#define</span> <span style="color: #A6E22E;">sqr</span><span style="color: #AE81FF;">(</span><span style="color: #FD971F;">x</span><span style="color: #AE81FF;">)</span> <span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">(</span>x<span style="color: #66D9EF;">)</span> * <span style="color: #66D9EF;">(</span>x<span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline19" class="outline-2">
<h2 id="orgheadline19"><span class="section-number-2">2</span> GETTING STARTED</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15"><span class="section-number-3">2.1</span> Learning C++: What Lies Before You</h3>
</div>
<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16"><span class="section-number-3">2.2</span> The Origins of C++: A Little History</h3>
</div>
<div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17"><span class="section-number-3">2.3</span> Portability and Standards</h3>
</div>
<div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18"><span class="section-number-3">2.4</span> The Mechanics of Creating a Program</h3>
</div>
</div>

<div id="outline-container-orgheadline25" class="outline-2">
<h2 id="orgheadline25"><span class="section-number-2">3</span> SETTING OUT TO C++</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline20" class="outline-3">
<h3 id="orgheadline20"><span class="section-number-3">3.1</span> C++ Initiation</h3>
</div>
<div id="outline-container-orgheadline22" class="outline-3">
<h3 id="orgheadline22"><span class="section-number-3">3.2</span> C++ Statements</h3>
<div class="outline-text-3" id="text-3-2">
</div><ol class="org-ol"><li><a id="orgheadline21"></a>Comments<br  /><div class="outline-text-4" id="text-3-2-1">
<ul class="org-ul">
<li>//</li>
<li><i>* *</i></li>
</ul>
</div></li></ol>
</div>
<div id="outline-container-orgheadline23" class="outline-3">
<h3 id="orgheadline23"><span class="section-number-3">3.3</span> More C++ Statements</h3>
</div>
<div id="outline-container-orgheadline24" class="outline-3">
<h3 id="orgheadline24"><span class="section-number-3">3.4</span> Functions</h3>
</div>
</div>



<div id="outline-container-orgheadline37" class="outline-2">
<h2 id="orgheadline37"><span class="section-number-2">4</span> DEALING WITH DATA</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-orgheadline33" class="outline-3">
<h3 id="orgheadline33"><span class="section-number-3">4.1</span> Simple Variables</h3>
<div class="outline-text-3" id="text-4-1">
</div><ol class="org-ol"><li><a id="orgheadline28"></a>Variables:<br  /><ul class="org-ul"><li><a id="orgheadline26"></a>common variables names<br  /><div class="outline-text-5" id="text-orgheadline26">
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">price_count_reader</span>;    <span style="color: #75715E;">// </span><span style="color: #75715E;">No abbreviation.</span>
<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">num_errors</span>;            <span style="color: #75715E;">// </span><span style="color: #75715E;">"num" is a widespread convention.</span>
<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">num_dns_connections</span>;   <span style="color: #75715E;">// </span><span style="color: #75715E;">Most people know what "DNS" stands for.</span>
</pre>
</div>
</div></li>

<li><a id="orgheadline27"></a>Class Data Members<br  /><div class="outline-text-5" id="text-orgheadline27">
<p>
Data members of classes, both static and non-static, are named like ordinary nonmember variables, but with a trailing underscore.
</p>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #F92672;">class</span> <span style="color: #66D9EF;">TableInfo</span> <span style="color: #AE81FF;">{</span>
  ...
 <span style="color: #F92672;">private</span>:
  <span style="color: #66D9EF;">string</span> <span style="color: #FD971F;">table_name_</span>;  <span style="color: #75715E;">// </span><span style="color: #75715E;">OK - underscore at end.</span>
  <span style="color: #66D9EF;">string</span> <span style="color: #FD971F;">tablename_</span>;   <span style="color: #75715E;">// </span><span style="color: #75715E;">OK.</span>
  <span style="color: #F92672;">static</span> <span style="color: #66D9EF;">Pool</span><span style="color: #66D9EF;">&lt;</span><span style="color: #66D9EF;">TableInfo</span><span style="color: #66D9EF;">&gt;</span>* <span style="color: #FD971F;">pool_</span>;  <span style="color: #75715E;">// </span><span style="color: #75715E;">OK.</span>
<span style="color: #AE81FF;">}</span>;
</pre>
</div>
</div></li></ul></li>

<li><a id="orgheadline29"></a>Constant Names<br  /><div class="outline-text-4" id="text-4-1-2">
<p>
Variables declared constexpr or const, and whose value is fixed for the duration of the program, are named with a leading "k" followed by mixed case. For example:
</p>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #F92672;">const</span> <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">kDaysInAWeek</span> = <span style="color: #AE81FF;">7</span>;
</pre>
</div>
</div></li>

<li><a id="orgheadline30"></a>Const Member Functions<br  /><div class="outline-text-4" id="text-4-1-3">
<p>
Making an object const makessure that only so called 'const' member functions can be called for the const object.
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #F92672;">const</span> <span style="color: #66D9EF;">Date</span> <span style="color: #FD971F;">dt</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">Const date object</span>
<span style="color: #F92672;">const</span> <span style="color: #66D9EF;">Point</span> <span style="color: #FD971F;">pt</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">Const point object</span>
</pre>
</div>
<p>
Const member functions are functions that do not change the state of the object. Typical examples of const member functions are accessing or selector functions.
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #F92672;">class</span> <span style="color: #66D9EF;">Date</span>
<span style="color: #AE81FF;">{</span><span style="color: #F92672;">public</span>:
<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E;">ret_day</span><span style="color: #66D9EF;">()</span> <span style="color: #F92672;">const</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">Constant member function</span>
<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E;">ret_month</span><span style="color: #66D9EF;">()</span> <span style="color: #F92672;">const</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">Constant member function</span>
<span style="color: #AE81FF;">}</span>;
<span style="color: #F92672;">class</span> <span style="color: #66D9EF;">Point</span>
<span style="color: #AE81FF;">{</span><span style="color: #F92672;">public</span>:
<span style="color: #66D9EF;">double</span> <span style="color: #A6E22E;">ret_x</span><span style="color: #66D9EF;">()</span> <span style="color: #F92672;">const</span>;
<span style="color: #66D9EF;">Point</span> <span style="color: #A6E22E;">add</span><span style="color: #66D9EF;">(</span><span style="color: #F92672;">const</span> <span style="color: #66D9EF;">Point</span>&amp; <span style="color: #FD971F;">pt</span><span style="color: #66D9EF;">)</span> <span style="color: #F92672;">const</span>;
<span style="color: #AE81FF;">}</span>;
</pre>
</div>
<p>
So there are three possibilities for the const keyword:
</p>
<ul class="org-ul">
<li>const arguments; const relates to argument</li>
<li>const member function; const relates to state of object</li>
<li>const return types; the return type cannot be changed by the caller</li>
</ul>
</div></li>
<li><a id="orgheadline31"></a>Function Names<br  /><div class="outline-text-4" id="text-4-1-4">
<div class="org-src-container">

<pre class="src src-c++">AddTableEntry<span style="color: #AE81FF;">()</span>
DeleteUrl<span style="color: #AE81FF;">()</span>
OpenFileOrDie<span style="color: #AE81FF;">()</span>
</pre>
</div>
</div></li>

<li><a id="orgheadline32"></a>File Names<br  /><div class="outline-text-4" id="text-4-1-5">
<ul class="org-ul">
<li>my_useful_class.cc</li>
<li>my-useful-class.cc</li>
<li>myusefulclass.cc</li>
<li>myusefulclass_test.cc // _unittest and _regtest are deprecated.</li>
</ul>
</div></li></ol>
</div>
<div id="outline-container-orgheadline34" class="outline-3">
<h3 id="orgheadline34"><span class="section-number-3">4.2</span> The const Qualifier</h3>
</div>
<div id="outline-container-orgheadline35" class="outline-3">
<h3 id="orgheadline35"><span class="section-number-3">4.3</span> Floating-Point Numbers</h3>
</div>
<div id="outline-container-orgheadline36" class="outline-3">
<h3 id="orgheadline36"><span class="section-number-3">4.4</span> C++ Arithmetic Operators</h3>
</div>
</div>
