CS/C++/C++.org
** Introducing Arrays
#+BEGIN_SRC c++
#include <iostream>

int main()
{
    int prime[5]; // hold the first 5 prime numbers
    prime[0] = 2; // The first element has index 0
    std::cout << "The lowest prime number is: " << prime[0] << "\n";
    std::cout << "The sum of the first 5 primes is: " << prime[0] + prime[1] + prime[2] + prime[3] + prime[4] << "\n";

    return 0;
}
int array[3][5] =
{
{ 1, 2, 3, 4, 5 }, // row 0
{ 6, 7, 8, 9, 10 }, // row 1
{ 11, 12, 13, 14, 15 } // row 2
};
for (int row = 0; row < numRows; ++row) // step through the rows in the array
    for (int col = 0; col < numCols; ++col) // step through each element in the row
        std::cout << array[row][col];
#+END_SRC
** Strings
- A string is an array of characters
- Declare using array notation
#+BEGIN_SRC c
char string[80];
/* A string of 80 characters */

#+END_SRC
- Last character of string should be ‘\0’
- Use functions declared in <string.h>
#+BEGIN_SRC c
void main()
{
char s1[] = {'C', ' ', 'l', 'a', 'n', 'g', 'u', 'a', 'g', 'e', '\0'};
char s2[] = "C language"; /* Adds the ‘\0’ for us */
char s3[80];
s3 = "Hello"; /* NOT POSSIBLE! We have to use strcpy() */
strcpy(s3, "Hello");
}
#+END_SRC
** Introducing the string Class
** Introducing Structures
The struct declaration is nothing more than a type definition. The members defined in the structure become concrete members when we create a variable of this struct type.
- Structure creates new type
#+BEGIN_SRC c
struct <name> { [members] };

#+END_SRC
- Example a new type representing a point
#+BEGIN_SRC C
struct point
{
int x;
int y;
};

#+END_SRC
*** Arrays of Structures
- Can initialise the elements upon declaring using {}
#+BEGIN_SRC c
struct point arr[2] = {{10, 11}, {11, 24}};

#+END_SRC
*** Structures and Pointers
- Access members of structures using dot (.)
#+BEGIN_SRC c
struct point pt;
pt.x = 10.0;

#+END_SRC
- When using pointers to structures use a -> to access struct members
#+BEGIN_SRC c
struct point* pp = &pt;
pt->x=20.0; /* Use -> to access members */
(*pt).y=30.0; /* Use dereference and . */

#+END_SRC
** Unions
- Or relation: variables contain value of one of the union field types
- Same syntax as struct only type union
union u_tag
{
int ival;
float fval;
};
- Size equal to size of largest member
** Enumerations
** Pointers and the Free Store
*** Pointers as Function Arguments
- Normally function arguments are copied on the stack
- If you don’t want a copy use pointers
#+BEGIN_SRC c
sqr(int* a);

#+END_SRC
- Pass argument address upon function call, 指针是地址，所以传参时应该给一个地址.
#+BEGIN_SRC c
int var = 10;
sqr(&var);

#+END_SRC
** Pointers, Arrays, and Pointer Arithmetic
