docs/CS/C++/C++.html



<div id="outline-container-orgheadline52" class="outline-2">
<h2 id="orgheadline52"><span class="section-number-2">5</span> COMPOUND TYPES</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-orgheadline38" class="outline-3">
<h3 id="orgheadline38"><span class="section-number-3">5.1</span> Introducing Arrays</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;iostream&gt;</span>

<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E;">main</span><span style="color: #AE81FF;">()</span>
<span style="color: #AE81FF;">{</span>
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">prime</span><span style="color: #66D9EF;">[</span><span style="color: #AE81FF;">5</span><span style="color: #66D9EF;">]</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">hold the first 5 prime numbers</span>
    prime<span style="color: #66D9EF;">[</span><span style="color: #AE81FF;">0</span><span style="color: #66D9EF;">]</span> = <span style="color: #AE81FF;">2</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">The first element has index 0</span>
    <span style="color: #AE81FF;">std</span>::cout &lt;&lt; <span style="color: #E6DB74;">"The lowest prime number is: "</span> &lt;&lt; prime<span style="color: #66D9EF;">[</span><span style="color: #AE81FF;">0</span><span style="color: #66D9EF;">]</span> &lt;&lt; <span style="color: #E6DB74;">"\n"</span>;
    <span style="color: #AE81FF;">std</span>::cout &lt;&lt; <span style="color: #E6DB74;">"The sum of the first 5 primes is: "</span> &lt;&lt; prime<span style="color: #66D9EF;">[</span><span style="color: #AE81FF;">0</span><span style="color: #66D9EF;">]</span> + prime<span style="color: #66D9EF;">[</span><span style="color: #AE81FF;">1</span><span style="color: #66D9EF;">]</span> + prime<span style="color: #66D9EF;">[</span><span style="color: #AE81FF;">2</span><span style="color: #66D9EF;">]</span> + prime<span style="color: #66D9EF;">[</span><span style="color: #AE81FF;">3</span><span style="color: #66D9EF;">]</span> + prime<span style="color: #66D9EF;">[</span><span style="color: #AE81FF;">4</span><span style="color: #66D9EF;">]</span> &lt;&lt; <span style="color: #E6DB74;">"\n"</span>;

    <span style="color: #F92672;">return</span> <span style="color: #AE81FF;">0</span>;
<span style="color: #AE81FF;">}</span>
<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">array</span><span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">3</span><span style="color: #AE81FF;">][</span><span style="color: #AE81FF;">5</span><span style="color: #AE81FF;">]</span> =
<span style="color: #AE81FF;">{</span>
<span style="color: #66D9EF;">{</span> <span style="color: #AE81FF;">1</span>, <span style="color: #AE81FF;">2</span>, <span style="color: #AE81FF;">3</span>, <span style="color: #AE81FF;">4</span>, <span style="color: #AE81FF;">5</span> <span style="color: #66D9EF;">}</span>, <span style="color: #75715E;">// </span><span style="color: #75715E;">row 0</span>
<span style="color: #66D9EF;">{</span> <span style="color: #AE81FF;">6</span>, <span style="color: #AE81FF;">7</span>, <span style="color: #AE81FF;">8</span>, <span style="color: #AE81FF;">9</span>, <span style="color: #AE81FF;">10</span> <span style="color: #66D9EF;">}</span>, <span style="color: #75715E;">// </span><span style="color: #75715E;">row 1</span>
<span style="color: #66D9EF;">{</span> <span style="color: #AE81FF;">11</span>, <span style="color: #AE81FF;">12</span>, <span style="color: #AE81FF;">13</span>, <span style="color: #AE81FF;">14</span>, <span style="color: #AE81FF;">15</span> <span style="color: #66D9EF;">}</span> <span style="color: #75715E;">// </span><span style="color: #75715E;">row 2</span>
<span style="color: #AE81FF;">}</span>;
<span style="color: #F92672;">for</span> <span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">row</span> = <span style="color: #AE81FF;">0</span>; row &lt; numRows; ++row<span style="color: #AE81FF;">)</span> <span style="color: #75715E;">// </span><span style="color: #75715E;">step through the rows in the array</span>
    <span style="color: #F92672;">for</span> <span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">col</span> = <span style="color: #AE81FF;">0</span>; col &lt; numCols; ++col<span style="color: #AE81FF;">)</span> <span style="color: #75715E;">// </span><span style="color: #75715E;">step through each element in the row</span>
        <span style="color: #AE81FF;">std</span>::cout &lt;&lt; array<span style="color: #AE81FF;">[</span>row<span style="color: #AE81FF;">][</span>col<span style="color: #AE81FF;">]</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline39" class="outline-3">
<h3 id="orgheadline39"><span class="section-number-3">5.2</span> Strings</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>A string is an array of characters</li>
<li>Declare using array notation</li>
</ul>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66D9EF;">char</span> <span style="color: #FD971F;">string</span><span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">80</span><span style="color: #AE81FF;">]</span>;
<span style="color: #75715E;">/* </span><span style="color: #75715E;">A string of 80 characters </span><span style="color: #75715E;">*/</span>
</pre>
</div>
<ul class="org-ul">
<li>Last character of string should be ‘\0’</li>
<li>Use functions declared in &lt;string.h&gt;</li>
</ul>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66D9EF;">void</span> <span style="color: #A6E22E;">main</span><span style="color: #AE81FF;">()</span>
<span style="color: #AE81FF;">{</span>
<span style="color: #66D9EF;">char</span> <span style="color: #FD971F;">s1</span><span style="color: #66D9EF;">[]</span> = <span style="color: #66D9EF;">{</span><span style="color: #E6DB74;">'C'</span>, <span style="color: #E6DB74;">' '</span>, <span style="color: #E6DB74;">'l'</span>, <span style="color: #E6DB74;">'a'</span>, <span style="color: #E6DB74;">'n'</span>, <span style="color: #E6DB74;">'g'</span>, <span style="color: #E6DB74;">'u'</span>, <span style="color: #E6DB74;">'a'</span>, <span style="color: #E6DB74;">'g'</span>, <span style="color: #E6DB74;">'e'</span>, <span style="color: #E6DB74;">'\0'</span><span style="color: #66D9EF;">}</span>;
<span style="color: #66D9EF;">char</span> <span style="color: #FD971F;">s2</span><span style="color: #66D9EF;">[]</span> = <span style="color: #E6DB74;">"C language"</span>; <span style="color: #75715E;">/* </span><span style="color: #75715E;">Adds the &#8216;\0&#8217; for us </span><span style="color: #75715E;">*/</span>
<span style="color: #66D9EF;">char</span> <span style="color: #FD971F;">s3</span><span style="color: #66D9EF;">[</span><span style="color: #AE81FF;">80</span><span style="color: #66D9EF;">]</span>;
s3 = <span style="color: #E6DB74;">"Hello"</span>; <span style="color: #75715E;">/* </span><span style="color: #75715E;">NOT POSSIBLE! We have to use strcpy() </span><span style="color: #75715E;">*/</span>
strcpy<span style="color: #66D9EF;">(</span>s3, <span style="color: #E6DB74;">"Hello"</span><span style="color: #66D9EF;">)</span>;
<span style="color: #AE81FF;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline40" class="outline-3">
<h3 id="orgheadline40"><span class="section-number-3">5.3</span> Introducing the string Class</h3>
</div>
<div id="outline-container-orgheadline43" class="outline-3">
<h3 id="orgheadline43"><span class="section-number-3">5.4</span> Introducing Structures</h3>
<div class="outline-text-3" id="text-5-4">
<p>
The struct declaration is nothing more than a type definition. The members defined in the structure become concrete members when we create a variable of this struct type.
</p>
<ul class="org-ul">
<li>Structure creates new type</li>
</ul>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #F92672;">struct</span> &lt;name&gt; <span style="color: #AE81FF;">{</span> <span style="color: #66D9EF;">[</span>members<span style="color: #66D9EF;">]</span> <span style="color: #AE81FF;">}</span>;
</pre>
</div>
<ul class="org-ul">
<li>Example a new type representing a point</li>
</ul>
<div class="org-src-container">

<pre class="src src-C"><span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">point</span>
<span style="color: #AE81FF;">{</span>
<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">x</span>;
<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">y</span>;
<span style="color: #AE81FF;">}</span>;
</pre>
</div>
</div>
<ol class="org-ol"><li><a id="orgheadline41"></a>Arrays of Structures<br  /><div class="outline-text-4" id="text-5-4-1">
<ul class="org-ul">
<li>Can initialise the elements upon declaring using {}</li>
</ul>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">point</span> <span style="color: #FD971F;">arr</span><span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">2</span><span style="color: #AE81FF;">]</span> = <span style="color: #AE81FF;">{</span><span style="color: #66D9EF;">{</span><span style="color: #AE81FF;">10</span>, <span style="color: #AE81FF;">11</span><span style="color: #66D9EF;">}</span>, <span style="color: #66D9EF;">{</span><span style="color: #AE81FF;">11</span>, <span style="color: #AE81FF;">24</span><span style="color: #66D9EF;">}</span><span style="color: #AE81FF;">}</span>;
</pre>
</div>
</div></li>
<li><a id="orgheadline42"></a>Structures and Pointers<br  /><div class="outline-text-4" id="text-5-4-2">
<ul class="org-ul">
<li>Access members of structures using dot (.)</li>
</ul>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">point</span> <span style="color: #FD971F;">pt</span>;
pt.x = <span style="color: #AE81FF;">10</span>.<span style="color: #AE81FF;">0</span>;
</pre>
</div>
<ul class="org-ul">
<li>When using pointers to structures use a -&gt; to access struct members</li>
</ul>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">point</span>* <span style="color: #FD971F;">pp</span> = &amp;pt;
pt-&gt;x=<span style="color: #AE81FF;">20</span>.<span style="color: #AE81FF;">0</span>; <span style="color: #75715E;">/* </span><span style="color: #75715E;">Use -&gt; to access members </span><span style="color: #75715E;">*/</span>
<span style="color: #AE81FF;">(</span>*pt<span style="color: #AE81FF;">)</span>.y=<span style="color: #AE81FF;">30</span>.<span style="color: #AE81FF;">0</span>; <span style="color: #75715E;">/* </span><span style="color: #75715E;">Use dereference and . </span><span style="color: #75715E;">*/</span>
</pre>
</div>
</div></li></ol>
</div>
<div id="outline-container-orgheadline44" class="outline-3">
<h3 id="orgheadline44"><span class="section-number-3">5.5</span> Unions</h3>
<div class="outline-text-3" id="text-5-5">
<ul class="org-ul">
<li>Or relation: variables contain value of one of the union field types</li>
<li>Same syntax as struct only type union</li>
</ul>
<p>
union u_tag
{
int ival;
float fval;
};
</p>
<ul class="org-ul">
<li>Size equal to size of largest member</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline45" class="outline-3">
<h3 id="orgheadline45"><span class="section-number-3">5.6</span> Enumerations</h3>
</div>
<div id="outline-container-orgheadline47" class="outline-3">
<h3 id="orgheadline47"><span class="section-number-3">5.7</span> Pointers and the Free Store</h3>
<div class="outline-text-3" id="text-5-7">
</div><ol class="org-ol"><li><a id="orgheadline46"></a>Pointers as Function Arguments<br  /><div class="outline-text-4" id="text-5-7-1">
<ul class="org-ul">
<li>Normally function arguments are copied on the stack</li>
<li>If you don’t want a copy use pointers</li>
</ul>
<div class="org-src-container">

<pre class="src src-c">sqr<span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">int</span>* <span style="color: #FD971F;">a</span><span style="color: #AE81FF;">)</span>;
</pre>
</div>
<ul class="org-ul">
<li>Pass argument address upon function call, 指针是地址，所以传参时应该给一个地址.</li>
</ul>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">var</span> = <span style="color: #AE81FF;">10</span>;
sqr<span style="color: #AE81FF;">(</span>&amp;var<span style="color: #AE81FF;">)</span>;
</pre>
</div>
</div></li></ol>
</div>
<div id="outline-container-orgheadline51" class="outline-3">
<h3 id="orgheadline51"><span class="section-number-3">5.8</span> Pointers, Arrays, and Pointer Arithmetic</h3>
