CS/C++/C++.org
*** arrays and pointers
- Array name is the address of the first element of the array
#+BEGIN_SRC c
int array[3];
/* array is address of first element
array == &array[0]*/

#+END_SRC
- Pointer also contains address of some element
- Can assign pointers to arrays
- Can use array indexing with pointers
*** swap value of two variables using pointers
#+begin_src c++
#include <stdio.h>

void Swap(int* a, int* b)
{
	int temp;		//use the variable temp to store one value.
	temp = (*b);	//temp equals to content of pointer b
	(*b) = (*a);	//pointer b equals to content of pointer a
	(*a) = temp;	//content of pointer a equals to temp

}
int main()
{
	int i = 123, j = 456;
	int* x = &i;	//x points to i
	int* y = &j;	//y points to j
	printf("Before swapping: i = %d, j = %d\n",i , j);

	Swap(x, y);
	printf("After swapping: i = %d, j = %d\n",i , j);
return 0;
}
#+end_src
*** Initialising Arrays
- Arrays need to be initialised element by element
- Cannot assign two arrays
#+BEGIN_SRC c
array_int1 = array_int2; /* NOT POSSIBLE */

#+END_SRC
- Can initialise upon creation by specifying each element
#+BEGIN_SRC c
int array_int1[4] = {1, 4, 5, 6};
float array_f[] = {10.23, 34.33, 30.0};

#+END_SRC

* LOOPS AND RELATIONAL EXPRESSIONS
** Introducing for Loops
** Relational Expressions
** The while Loop
** The do while Loop
** Loops and Text Input
** Nested Loops and Two-Dimensional Arrays

** The compound or block statement
- Blocks are pieces of discrete code
- Blocks are bounded with braces {}
- Variables must be declared in the beginning of blocks
- Indent the statements inside blocks
** The if statement
- if - else
- switch
#+BEGIN_SRC c++
/* Leaving out these brackets is not advisable because
of future modifications to one of the sub statements of the if-else construction.*/
if (a > b)
{
    printf("a is larger than b\n");
}
else
{
    printf("a is not larger than b");
}
#+END_SRC
*** switch
The switch statement is almost equal to the if-else construction.
The syntax is:
#+BEGIN_SRC c++
switch(<expression>)
{
case <const_expression1>:
    <sub_statement> [break;]
case <const_expression2>:
    <sub_statement> [break;]
case <const_expression3>:
    <sub_statement> [break;]
default:
    <sub_statement>
}
#+END_SRC
The break statement is optional in the different cases. When it is left out all the following sub_statements are executed until a break statement or the end of the switch is reached.
** The for loop
Creating an infinite loop
#+BEGIN_SRC c
for (;;)
#+END_SRC
** The while loop
#+BEGIN_SRC c
do
    <sub_statement>
while (<expression>); /* do not forget the semicolon */
#+END_SRC
** The do-while loop
When creating a do-while loop do not place a semi-colon ';' after the while expression. Placing a
semicolon can create an infinite loop.
** Break and continue statements
** Multiple choices, the switch statement
** Goto and labels


* BRANCHING STATEMENTS AND LOGICAL OPERATORS
** The if Statement
** Logical Expressions
** The cctype Library of Character Functions
** The ?: Operator
#+BEGIN_SRC c
const int x = (a<b) ? b : a;
#+END_SRC
** The switch Statement
