docs/CS/C++/C++.html
<div class="outline-text-3" id="text-5-8">
</div><ol class="org-ol"><li><a id="orgheadline48"></a>arrays and pointers<br  /><div class="outline-text-4" id="text-5-8-1">
<ul class="org-ul">
<li>Array name is the address of the first element of the array</li>
</ul>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">array</span><span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">3</span><span style="color: #AE81FF;">]</span>;
<span style="color: #75715E;">/* </span><span style="color: #75715E;">array is address of first element</span>
<span style="color: #75715E;">array == &amp;array[0]</span><span style="color: #75715E;">*/</span>
</pre>
</div>
<ul class="org-ul">
<li>Pointer also contains address of some element</li>
<li>Can assign pointers to arrays</li>
<li>Can use array indexing with pointers</li>
</ul>
</div></li>
<li><a id="orgheadline49"></a>swap value of two variables using pointers<br  /><div class="outline-text-4" id="text-5-8-2">
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">&lt;stdio.h&gt;</span>

<span style="color: #66D9EF;">void</span> <span style="color: #A6E22E;">Swap</span><span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">int</span>* <span style="color: #FD971F;">a</span>, <span style="color: #66D9EF;">int</span>* <span style="color: #FD971F;">b</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">{</span>
  <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">temp</span>;   <span style="color: #75715E;">//</span><span style="color: #75715E;">use the variable temp to store one value.</span>
  temp = <span style="color: #66D9EF;">(</span>*b<span style="color: #66D9EF;">)</span>;  <span style="color: #75715E;">//</span><span style="color: #75715E;">temp equals to content of pointer b</span>
  <span style="color: #66D9EF;">(</span>*b<span style="color: #66D9EF;">)</span> = <span style="color: #66D9EF;">(</span>*a<span style="color: #66D9EF;">)</span>;  <span style="color: #75715E;">//</span><span style="color: #75715E;">pointer b equals to content of pointer a</span>
  <span style="color: #66D9EF;">(</span>*a<span style="color: #66D9EF;">)</span> = temp;  <span style="color: #75715E;">//</span><span style="color: #75715E;">content of pointer a equals to temp</span>

<span style="color: #AE81FF;">}</span>
<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E;">main</span><span style="color: #AE81FF;">()</span>
<span style="color: #AE81FF;">{</span>
  <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">i</span> = <span style="color: #AE81FF;">123</span>, <span style="color: #FD971F;">j</span> = <span style="color: #AE81FF;">456</span>;
  <span style="color: #66D9EF;">int</span>* <span style="color: #FD971F;">x</span> = &amp;i;  <span style="color: #75715E;">//</span><span style="color: #75715E;">x points to i</span>
  <span style="color: #66D9EF;">int</span>* <span style="color: #FD971F;">y</span> = &amp;j;  <span style="color: #75715E;">//</span><span style="color: #75715E;">y points to j</span>
  printf<span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">"Before swapping: i = %d, j = %d\n"</span>,i , j<span style="color: #66D9EF;">)</span>;

  Swap<span style="color: #66D9EF;">(</span>x, y<span style="color: #66D9EF;">)</span>;
  printf<span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">"After swapping: i = %d, j = %d\n"</span>,i , j<span style="color: #66D9EF;">)</span>;
<span style="color: #F92672;">return</span> <span style="color: #AE81FF;">0</span>;
<span style="color: #AE81FF;">}</span>
</pre>
</div>
</div></li>
<li><a id="orgheadline50"></a>Initialising Arrays<br  /><div class="outline-text-4" id="text-5-8-3">
<ul class="org-ul">
<li>Arrays need to be initialised element by element</li>
<li>Cannot assign two arrays</li>
</ul>
<div class="org-src-container">

<pre class="src src-c">array_int1 = array_int2; <span style="color: #75715E;">/* </span><span style="color: #75715E;">NOT POSSIBLE </span><span style="color: #75715E;">*/</span>
</pre>
</div>
<ul class="org-ul">
<li>Can initialise upon creation by specifying each element</li>
</ul>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">array_int1</span><span style="color: #AE81FF;">[</span><span style="color: #AE81FF;">4</span><span style="color: #AE81FF;">]</span> = <span style="color: #AE81FF;">{</span><span style="color: #AE81FF;">1</span>, <span style="color: #AE81FF;">4</span>, <span style="color: #AE81FF;">5</span>, <span style="color: #AE81FF;">6</span><span style="color: #AE81FF;">}</span>;
<span style="color: #66D9EF;">float</span> <span style="color: #FD971F;">array_f</span><span style="color: #AE81FF;">[]</span> = <span style="color: #AE81FF;">{</span><span style="color: #AE81FF;">10</span>.<span style="color: #AE81FF;">23</span>, <span style="color: #AE81FF;">34</span>.<span style="color: #AE81FF;">33</span>, <span style="color: #AE81FF;">30</span>.<span style="color: #AE81FF;">0</span><span style="color: #AE81FF;">}</span>;
</pre>
</div>
</div></li></ol>
</div>
</div>

<div id="outline-container-orgheadline68" class="outline-2">
<h2 id="orgheadline68"><span class="section-number-2">6</span> LOOPS AND RELATIONAL EXPRESSIONS</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-orgheadline53" class="outline-3">
<h3 id="orgheadline53"><span class="section-number-3">6.1</span> Introducing for Loops</h3>
</div>
<div id="outline-container-orgheadline54" class="outline-3">
<h3 id="orgheadline54"><span class="section-number-3">6.2</span> Relational Expressions</h3>
</div>
<div id="outline-container-orgheadline55" class="outline-3">
<h3 id="orgheadline55"><span class="section-number-3">6.3</span> The while Loop</h3>
</div>
<div id="outline-container-orgheadline56" class="outline-3">
<h3 id="orgheadline56"><span class="section-number-3">6.4</span> The do while Loop</h3>
</div>
<div id="outline-container-orgheadline57" class="outline-3">
<h3 id="orgheadline57"><span class="section-number-3">6.5</span> Loops and Text Input</h3>
</div>
<div id="outline-container-orgheadline58" class="outline-3">
<h3 id="orgheadline58"><span class="section-number-3">6.6</span> Nested Loops and Two-Dimensional Arrays</h3>
</div>

<div id="outline-container-orgheadline59" class="outline-3">
<h3 id="orgheadline59"><span class="section-number-3">6.7</span> The compound or block statement</h3>
<div class="outline-text-3" id="text-6-7">
<ul class="org-ul">
<li>Blocks are pieces of discrete code</li>
<li>Blocks are bounded with braces {}</li>
<li>Variables must be declared in the beginning of blocks</li>
<li>Indent the statements inside blocks</li>
</ul>
</div>
</div>
<div id="outline-container-orgheadline61" class="outline-3">
<h3 id="orgheadline61"><span class="section-number-3">6.8</span> The if statement</h3>
<div class="outline-text-3" id="text-6-8">
<ul class="org-ul">
<li>if - else</li>
<li>switch</li>
</ul>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #75715E;">/* </span><span style="color: #75715E;">Leaving out these brackets is not advisable because</span>
<span style="color: #75715E;">of future modifications to one of the sub statements of the if-else construction.*/</span>
<span style="color: #F92672;">if</span> <span style="color: #AE81FF;">(</span>a &gt; b<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">{</span>
    printf<span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">"a is larger than b\n"</span><span style="color: #66D9EF;">)</span>;
<span style="color: #AE81FF;">}</span>
<span style="color: #F92672;">else</span>
<span style="color: #AE81FF;">{</span>
    printf<span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">"a is not larger than b"</span><span style="color: #66D9EF;">)</span>;
<span style="color: #AE81FF;">}</span>
</pre>
</div>
</div>
<ol class="org-ol"><li><a id="orgheadline60"></a>switch<br  /><div class="outline-text-4" id="text-6-8-1">
<p>
The switch statement is almost equal to the if-else construction.
The syntax is:
</p>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #F92672;">switch</span><span style="color: #AE81FF;">(</span>&lt;expression&gt;<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">{</span>
<span style="color: #F92672;">case</span> &lt;const_expression1&gt;:
    &lt;sub_statement&gt; <span style="color: #66D9EF;">[</span><span style="color: #F92672;">break</span>;<span style="color: #66D9EF;">]</span>
<span style="color: #F92672;">case</span> &lt;const_expression2&gt;:
    &lt;sub_statement&gt; <span style="color: #66D9EF;">[</span><span style="color: #F92672;">break</span>;<span style="color: #66D9EF;">]</span>
<span style="color: #F92672;">case</span> &lt;const_expression3&gt;:
    &lt;sub_statement&gt; <span style="color: #66D9EF;">[</span><span style="color: #F92672;">break</span>;<span style="color: #66D9EF;">]</span>
<span style="color: #F92672;">default</span>:
    &lt;sub_statement&gt;
<span style="color: #AE81FF;">}</span>
</pre>
</div>
<p>
The break statement is optional in the different cases. When it is left out all the following sub_statements are executed until a break statement or the end of the switch is reached.
</p>
</div></li></ol>
</div>
<div id="outline-container-orgheadline62" class="outline-3">
<h3 id="orgheadline62"><span class="section-number-3">6.9</span> The for loop</h3>
<div class="outline-text-3" id="text-6-9">
<p>
Creating an infinite loop
</p>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #F92672;">for</span> <span style="color: #AE81FF;">(</span>;;<span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline63" class="outline-3">
<h3 id="orgheadline63"><span class="section-number-3">6.10</span> The while loop</h3>
<div class="outline-text-3" id="text-6-10">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #F92672;">do</span>
    &lt;sub_statement&gt;
<span style="color: #F92672;">while</span> <span style="color: #AE81FF;">(</span>&lt;expression&gt;<span style="color: #AE81FF;">)</span>; <span style="color: #75715E;">/* </span><span style="color: #75715E;">do not forget the semicolon </span><span style="color: #75715E;">*/</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline64" class="outline-3">
<h3 id="orgheadline64"><span class="section-number-3">6.11</span> The do-while loop</h3>
<div class="outline-text-3" id="text-6-11">
<p>
When creating a do-while loop do not place a semi-colon ';' after the while expression. Placing a
semicolon can create an infinite loop.
</p>
</div>
</div>
<div id="outline-container-orgheadline65" class="outline-3">
<h3 id="orgheadline65"><span class="section-number-3">6.12</span> Break and continue statements</h3>
</div>
<div id="outline-container-orgheadline66" class="outline-3">
<h3 id="orgheadline66"><span class="section-number-3">6.13</span> Multiple choices, the switch statement</h3>
</div>
<div id="outline-container-orgheadline67" class="outline-3">
<h3 id="orgheadline67"><span class="section-number-3">6.14</span> Goto and labels</h3>
</div>
</div>


<div id="outline-container-orgheadline77" class="outline-2">
<h2 id="orgheadline77"><span class="section-number-2">7</span> BRANCHING STATEMENTS AND LOGICAL OPERATORS</h2>
<div class="outline-text-2" id="text-7">
</div><div id="outline-container-orgheadline69" class="outline-3">
<h3 id="orgheadline69"><span class="section-number-3">7.1</span> The if Statement</h3>
</div>
<div id="outline-container-orgheadline70" class="outline-3">
<h3 id="orgheadline70"><span class="section-number-3">7.2</span> Logical Expressions</h3>
</div>
<div id="outline-container-orgheadline71" class="outline-3">
<h3 id="orgheadline71"><span class="section-number-3">7.3</span> The cctype Library of Character Functions</h3>
</div>
