CS/C++/C++.org
** The break and continue Statements
** Number-Reading Loops
** Simple File Input/Output



* FUNCTIONS: C++’S PROGRAMMING MODULES
** Function Review
*** Function Signatures
- A function consists of a return type, name and arguments
- The declaration is a description of the function characteristics
(signature)
<return_type> name([<arg_type arg, arg_type arg, ...>]);
#+BEGIN_SRC c++
int sqr(int);
/* returns: int
name: sqr
arguments: one int
*/
#+END_SRC
The function declaration needs to be repeated in every source file where we use the function. If 20 different source files use the function multiply() we have to declare it in all of those source files. *An easier way is to create a so called header file which contains the declarations of commonly used
functions (see next module).*

- The definition is the implementation of the function (body with code)
<return_type> name([<arg_type arg, arg_type arg, ...>])
{
}
** Function Arguments and Passing by Value

** Functions and Arrays
** Functions and Two-Dimensional Arrays
The pointer equivalent is a double pointer (pointer to a pointer)
#+BEGIN_SRC c
int** pmarr;

#+END_SRC
** Functions and C-Style Strings
** Functions and Structures
** Functions and string Class Objects
** Recursion
** Pointers to Functions



* ADVENTURES IN FUNCTIONS
** C++ Inline Functions
** Reference Variables
** Default Arguments
** Function Overloading
** Function Templates



* MEMORY MODELS AND NAMESPACES
** Separate Compilation
*** Conditional Compilation
- #ifdef
- #ifndef
- #elif
- #else
- #endif
*** Header Files and Directives
- Can include header file multiple times
- This can lead to redefinition errors
- Prevent multiple inclusion:
#+BEGIN_SRC c++
#ifndef CONSTANT_NAME
#define CONSTANT_NAME
/* declarations */
#endif

#+END_SRC
There is a possibility that a header file gets included more than once during one compilation. The
definitions in that header file will be defined more than once and generate a compiler error.
#+BEGIN_SRC c
#include "mine.h"
#include "mine.h" /* Error multiple declarations */
#+END_SRC
use
#+BEGIN_SRC c
#ifndef MINE_H
#define MINE_H
void print(void);
/* Other definitions */
#endif
#+END_SRC
** Storage Duration, Scope, and Linkage
** The Placement new Operator
** Namespaces



* OBJECTS AND CLASSES
** Procedural and Object-Oriented Programming
*** Steps for OO project
- Requirements Determination (RD)
  - Specify the problem and corresponding stakeholders
- Object Oriented Analysis (OOA)
  - Model the problem into a domain hierarchy
- Object Oriented Design (OOD)
  - Take hardware and others into consideration, apply Design Patterns
- Object Oriented Programming (OOP)
  - Implement the model in an OO language
** Abstraction and Classes
*** Abstract Data Types
- State, data members (hidden)
*private*
 - Data Hiding
 - User only sees functionality, not implementation
 - When implementation changes no effect to client code
 - Data Encapsulation
 - Combining state with functionality
- Behaviour, member functions
*public*

how does an object react to external events or messages?
** Class Constructors and Destructors
** Knowing Your Objects: The this Pointer
** An Array of Objects
** The Interface and Implementation Revisited
** Class Scope
** Abstract Data Types



* WORKING WITH CLASSES
** Operator Overloading
The syntax for an operator overload is:

$<return_type> operator <op_name>(<argument_type>)$
