docs/CS/C++/C++.html
<div id="outline-container-orgheadline72" class="outline-3">
<h3 id="orgheadline72"><span class="section-number-3">7.4</span> The ?: Operator</h3>
<div class="outline-text-3" id="text-7-4">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #F92672;">const</span> <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">x</span> = <span style="color: #AE81FF;">(</span>a&lt;b<span style="color: #AE81FF;">)</span> ? b : a;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline73" class="outline-3">
<h3 id="orgheadline73"><span class="section-number-3">7.5</span> The switch Statement</h3>
</div>
<div id="outline-container-orgheadline74" class="outline-3">
<h3 id="orgheadline74"><span class="section-number-3">7.6</span> The break and continue Statements</h3>
</div>
<div id="outline-container-orgheadline75" class="outline-3">
<h3 id="orgheadline75"><span class="section-number-3">7.7</span> Number-Reading Loops</h3>
</div>
<div id="outline-container-orgheadline76" class="outline-3">
<h3 id="orgheadline76"><span class="section-number-3">7.8</span> Simple File Input/Output</h3>
</div>
</div>



<div id="outline-container-orgheadline88" class="outline-2">
<h2 id="orgheadline88"><span class="section-number-2">8</span> FUNCTIONS: C++’S PROGRAMMING MODULES</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-orgheadline79" class="outline-3">
<h3 id="orgheadline79"><span class="section-number-3">8.1</span> Function Review</h3>
<div class="outline-text-3" id="text-8-1">
</div><ol class="org-ol"><li><a id="orgheadline78"></a>Function Signatures<br  /><div class="outline-text-4" id="text-8-1-1">
<ul class="org-ul">
<li>A function consists of a return type, name and arguments</li>
<li>The declaration is a description of the function characteristics</li>
</ul>
<p>
(signature)
&lt;return_type&gt; name([&lt;arg_type arg, arg_type arg, &#x2026;&gt;]);
</p>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #66D9EF;">int</span> <span style="color: #A6E22E;">sqr</span><span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">int</span><span style="color: #AE81FF;">)</span>;
<span style="color: #75715E;">/* </span><span style="color: #75715E;">returns: int</span>
<span style="color: #75715E;">name: sqr</span>
<span style="color: #75715E;">arguments: one int</span>
<span style="color: #75715E;">*/</span>
</pre>
</div>
<p>
The function declaration needs to be repeated in every source file where we use the function. If 20 different source files use the function multiply() we have to declare it in all of those source files. <b>An easier way is to create a so called header file which contains the declarations of commonly used
functions (see next module).</b>
</p>

<ul class="org-ul">
<li>The definition is the implementation of the function (body with code)</li>
</ul>
<p>
&lt;return_type&gt; name([&lt;arg_type arg, arg_type arg, &#x2026;&gt;])
{
}
</p>
</div></li></ol>
</div>
<div id="outline-container-orgheadline80" class="outline-3">
<h3 id="orgheadline80"><span class="section-number-3">8.2</span> Function Arguments and Passing by Value</h3>
</div>

<div id="outline-container-orgheadline81" class="outline-3">
<h3 id="orgheadline81"><span class="section-number-3">8.3</span> Functions and Arrays</h3>
</div>
<div id="outline-container-orgheadline82" class="outline-3">
<h3 id="orgheadline82"><span class="section-number-3">8.4</span> Functions and Two-Dimensional Arrays</h3>
<div class="outline-text-3" id="text-8-4">
<p>
The pointer equivalent is a double pointer (pointer to a pointer)
</p>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66D9EF;">int</span>** <span style="color: #FD971F;">pmarr</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline83" class="outline-3">
<h3 id="orgheadline83"><span class="section-number-3">8.5</span> Functions and C-Style Strings</h3>
</div>
<div id="outline-container-orgheadline84" class="outline-3">
<h3 id="orgheadline84"><span class="section-number-3">8.6</span> Functions and Structures</h3>
</div>
<div id="outline-container-orgheadline85" class="outline-3">
<h3 id="orgheadline85"><span class="section-number-3">8.7</span> Functions and string Class Objects</h3>
</div>
<div id="outline-container-orgheadline86" class="outline-3">
<h3 id="orgheadline86"><span class="section-number-3">8.8</span> Recursion</h3>
</div>
<div id="outline-container-orgheadline87" class="outline-3">
<h3 id="orgheadline87"><span class="section-number-3">8.9</span> Pointers to Functions</h3>
</div>
</div>



<div id="outline-container-orgheadline94" class="outline-2">
<h2 id="orgheadline94"><span class="section-number-2">9</span> ADVENTURES IN FUNCTIONS</h2>
<div class="outline-text-2" id="text-9">
</div><div id="outline-container-orgheadline89" class="outline-3">
<h3 id="orgheadline89"><span class="section-number-3">9.1</span> C++ Inline Functions</h3>
</div>
<div id="outline-container-orgheadline90" class="outline-3">
<h3 id="orgheadline90"><span class="section-number-3">9.2</span> Reference Variables</h3>
</div>
<div id="outline-container-orgheadline91" class="outline-3">
<h3 id="orgheadline91"><span class="section-number-3">9.3</span> Default Arguments</h3>
</div>
<div id="outline-container-orgheadline92" class="outline-3">
<h3 id="orgheadline92"><span class="section-number-3">9.4</span> Function Overloading</h3>
</div>
<div id="outline-container-orgheadline93" class="outline-3">
<h3 id="orgheadline93"><span class="section-number-3">9.5</span> Function Templates</h3>
</div>
</div>



<div id="outline-container-orgheadline101" class="outline-2">
<h2 id="orgheadline101"><span class="section-number-2">10</span> MEMORY MODELS AND NAMESPACES</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-orgheadline97" class="outline-3">
<h3 id="orgheadline97"><span class="section-number-3">10.1</span> Separate Compilation</h3>
<div class="outline-text-3" id="text-10-1">
</div><ol class="org-ol"><li><a id="orgheadline95"></a>Conditional Compilation<br  /><div class="outline-text-4" id="text-10-1-1">
<ul class="org-ul">
<li>#ifdef</li>
<li>#ifndef</li>
<li>#elif</li>
<li>#else</li>
<li>#endif</li>
</ul>
</div></li>
<li><a id="orgheadline96"></a>Header Files and Directives<br  /><div class="outline-text-4" id="text-10-1-2">
<ul class="org-ul">
<li>Can include header file multiple times</li>
<li>This can lead to redefinition errors</li>
<li>Prevent multiple inclusion:</li>
</ul>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #F92672;">#if</span><span style="color: #F92672; font-weight: bold;">n</span><span style="color: #F92672;">def</span> CONSTANT_NAME
<span style="color: #F92672;">#define</span> <span style="color: #FD971F;">CONSTANT_NAME</span>
<span style="color: #75715E;">/* </span><span style="color: #75715E;">declarations */</span>
<span style="color: #F92672;">#endif</span>
</pre>
</div>
<p>
There is a possibility that a header file gets included more than once during one compilation. The
definitions in that header file will be defined more than once and generate a compiler error.
</p>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">"mine.h"</span>
<span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">"mine.h"</span> <span style="color: #75715E;">/* </span><span style="color: #75715E;">Error multiple declarations </span><span style="color: #75715E;">*/</span>
</pre>
</div>
<p>
use
</p>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #F92672;">#if</span><span style="color: #F92672; font-weight: bold;">n</span><span style="color: #F92672;">def</span> MINE_H
<span style="color: #F92672;">#define</span> <span style="color: #FD971F;">MINE_H</span>
<span style="color: #66D9EF;">void</span> <span style="color: #A6E22E;">print</span><span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">void</span><span style="color: #AE81FF;">)</span>;
<span style="color: #75715E;">/* </span><span style="color: #75715E;">Other definitions </span><span style="color: #75715E;">*/</span>
<span style="color: #F92672;">#endif</span>
</pre>
</div>
</div></li></ol>
</div>
<div id="outline-container-orgheadline98" class="outline-3">
<h3 id="orgheadline98"><span class="section-number-3">10.2</span> Storage Duration, Scope, and Linkage</h3>
</div>
<div id="outline-container-orgheadline99" class="outline-3">
<h3 id="orgheadline99"><span class="section-number-3">10.3</span> The Placement new Operator</h3>
</div>
<div id="outline-container-orgheadline100" class="outline-3">
<h3 id="orgheadline100"><span class="section-number-3">10.4</span> Namespaces</h3>
</div>
</div>



<div id="outline-container-orgheadline112" class="outline-2">
<h2 id="orgheadline112"><span class="section-number-2">11</span> OBJECTS AND CLASSES</h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-orgheadline103" class="outline-3">
<h3 id="orgheadline103"><span class="section-number-3">11.1</span> Procedural and Object-Oriented Programming</h3>
<div class="outline-text-3" id="text-11-1">
</div><ol class="org-ol"><li><a id="orgheadline102"></a>Steps for OO project<br  /><div class="outline-text-4" id="text-11-1-1">
<ul class="org-ul">
<li>Requirements Determination (RD)
<ul class="org-ul">
<li>Specify the problem and corresponding stakeholders</li>
</ul></li>
<li>Object Oriented Analysis (OOA)
<ul class="org-ul">
<li>Model the problem into a domain hierarchy</li>
</ul></li>
<li>Object Oriented Design (OOD)
<ul class="org-ul">
<li>Take hardware and others into consideration, apply Design Patterns</li>
</ul></li>
<li>Object Oriented Programming (OOP)
<ul class="org-ul">
<li>Implement the model in an OO language</li>
</ul></li>
</ul>
</div></li></ol>
</div>
<div id="outline-container-orgheadline105" class="outline-3">
<h3 id="orgheadline105"><span class="section-number-3">11.2</span> Abstraction and Classes</h3>
<div class="outline-text-3" id="text-11-2">
</div><ol class="org-ol"><li><a id="orgheadline104"></a>Abstract Data Types<br  /><div class="outline-text-4" id="text-11-2-1">
<ul class="org-ul">
<li>State, data members (hidden)</li>
</ul>
<p>
<b>private</b>
</p>
<ul class="org-ul">
<li>Data Hiding</li>
<li>User only sees functionality, not implementation</li>
<li>When implementation changes no effect to client code</li>
<li>Data Encapsulation</li>
<li>Combining state with functionality</li>
</ul>
<ul class="org-ul">
<li>Behaviour, member functions</li>
</ul>
<p>
<b>public</b>
</p>

<p>
how does an object react to external events or messages?
</p>
</div></li></ol>
</div>
<div id="outline-container-orgheadline106" class="outline-3">
<h3 id="orgheadline106"><span class="section-number-3">11.3</span> Class Constructors and Destructors</h3>
</div>
<div id="outline-container-orgheadline107" class="outline-3">
<h3 id="orgheadline107"><span class="section-number-3">11.4</span> Knowing Your Objects: The this Pointer</h3>
</div>
<div id="outline-container-orgheadline108" class="outline-3">
<h3 id="orgheadline108"><span class="section-number-3">11.5</span> An Array of Objects</h3>
</div>
<div id="outline-container-orgheadline109" class="outline-3">
<h3 id="orgheadline109"><span class="section-number-3">11.6</span> The Interface and Implementation Revisited</h3>
</div>
<div id="outline-container-orgheadline110" class="outline-3">
<h3 id="orgheadline110"><span class="section-number-3">11.7</span> Class Scope</h3>
</div>
<div id="outline-container-orgheadline111" class="outline-3">
<h3 id="orgheadline111"><span class="section-number-3">11.8</span> Abstract Data Types</h3>
</div>
</div>



<div id="outline-container-orgheadline126" class="outline-2">
<h2 id="orgheadline126"><span class="section-number-2">12</span> WORKING WITH CLASSES</h2>
<div class="outline-text-2" id="text-12">
</div><div id="outline-container-orgheadline113" class="outline-3">
<h3 id="orgheadline113"><span class="section-number-3">12.1</span> Operator Overloading</h3>
<div class="outline-text-3" id="text-12-1">
<p>
The syntax for an operator overload is:
</p>

<p>
\(<return_type> operator <op_name>(<argument_type>)\)
</p>
</div>
</div>
