docs/CS/C++/C++.html
<div id="outline-container-orgheadline121" class="outline-3">
<h3 id="orgheadline121"><span class="section-number-3">12.2</span> Time on Our Hands: Developing an Operator Overloading Example</h3>
<div class="outline-text-3" id="text-12-2">
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #F92672;">class</span> <span style="color: #66D9EF;">Matrix</span>
<span style="color: #AE81FF;">{</span>
<span style="color: #F92672;">public</span>:
<span style="color: #66D9EF;">Matrix</span> <span style="color: #A6E22E;">multiply</span><span style="color: #66D9EF;">(</span><span style="color: #F92672;">const</span> <span style="color: #66D9EF;">Matrix</span>&amp; <span style="color: #FD971F;">mat</span><span style="color: #66D9EF;">)</span>;
<span style="color: #66D9EF;">Matrix</span> <span style="color: #F92672;">operator</span><span style="color: #A6E22E;">*</span><span style="color: #66D9EF;">(</span><span style="color: #F92672;">const</span> <span style="color: #66D9EF;">Matrix</span>&amp; <span style="color: #FD971F;">mat</span><span style="color: #66D9EF;">)</span>; <span style="color: #75715E;">//</span><span style="color: #75715E;">Binary operato</span>
<span style="color: #AE81FF;">}</span>;
</pre>
</div>
</div>
<ol class="org-ol"><li><a id="orgheadline114"></a>OVERLOADING UNARY OPERATORS<br  /><div class="outline-text-4" id="text-12-2-1">
<p>
The unary operators do not have an argument.
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #F92672;">class</span> <span style="color: #66D9EF;">Matrix</span>
<span style="color: #AE81FF;">{</span>
<span style="color: #F92672;">public</span>:
...<span style="color: #F92672;">operator</span>-<span style="color: #66D9EF;">()</span>;
<span style="color: #AE81FF;">}</span>;
-m1; <span style="color: #75715E;">// </span><span style="color: #75715E;">Stand alone operation changes m1</span>
m2 = m3 * -m1; <span style="color: #75715E;">// </span><span style="color: #75715E;">In calculation does not change m1</span>
</pre>
</div>

<p>
If we allow the client to use the operator as a stand-alone operator, the return type can be void or a
reference to the object.
In the second option the function must return a matrix, the changed matrix (preferable).
</p>
</div></li>
<li><a id="orgheadline115"></a>Assignment operators are the operators which have a '=' in them.<br  /><div class="outline-text-4" id="text-12-2-2">
<p>
=, +=, -=, *=, &amp;=, &lt;&lt;=, &gt;&gt;= etc..
</p>
</div></li>
<li><a id="orgheadline116"></a>ASSIGNMENT VS. COPY CONSTRUCTOR<br  /><div class="outline-text-4" id="text-12-2-3">
<p>
The assignment operator and the copy constructor are two member functions with almost the same functionality they both copy data members of one object in the current. The difference between the two member functions is that the copy constructor is called when the object is created (the copy) and the assignment operator is called when the object that is destined to be the copy already exists.
</p>
</div></li>
<li><a id="orgheadline117"></a>Objects Returning Themselves<br  /><div class="outline-text-4" id="text-12-2-4">
<ul class="org-ul">
<li>Object can return it self (the current object)</li>
<li>Objects reference themselves by using the ‘this’ pointer</li>
<li>Can only be used inside member functions (for the current object)</li>
<li>Used as an 'ordinary' pointer to an object</li>
</ul>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66D9EF;">Point</span> <span style="color: #FD971F;">Point</span>::operator = <span style="color: #AE81FF;">(</span><span style="color: #F92672;">const</span> <span style="color: #66D9EF;">Point</span>&amp; source<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">{</span>
m_x = source.m_x;
m_y = source.m_y;
<span style="color: #F92672;">return</span> *this; <span style="color: #75715E;">// </span><span style="color: #75715E;">Copy of current object is returned</span>
<span style="color: #AE81FF;">}</span>
</pre>
</div>
</div></li>
<li><a id="orgheadline118"></a>RETURNING REFERENCES<br  /><div class="outline-text-4" id="text-12-2-5">
<p>
By using reference as return values we prevent the system from creating copies of whatever is returned.
</p>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #66D9EF;">Point</span>&amp; <span style="color: #A6E22E;">print</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">const</span> <span style="color: #66D9EF;">Point</span>&amp; <span style="color: #FD971F;">pt</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">{</span>
cout &lt;&lt; pt.ret_x<span style="color: #66D9EF;">()</span> &lt;&lt; endl;
cout &lt;&lt; pt.ret_y<span style="color: #66D9EF;">()</span> &lt;&lt; endl;
<span style="color: #F92672;">return</span> pt; <span style="color: #75715E;">// </span><span style="color: #75715E;">No copy is created</span>
<span style="color: #AE81FF;">}</span>
<span style="color: #66D9EF;">void</span> <span style="color: #A6E22E;">main</span><span style="color: #AE81FF;">()</span>
<span style="color: #AE81FF;">{</span>
<span style="color: #66D9EF;">Point</span> <span style="color: #FD971F;">pt</span>;
pt = print<span style="color: #66D9EF;">(</span>pt<span style="color: #66D9EF;">)</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">pt is assigned what the print function</span>
<span style="color: #75715E;">// </span><span style="color: #75715E;">returns in this case pt itself</span>
<span style="color: #AE81FF;">}</span>
</pre>
</div>
<p>
Our previous assignment operator returned a copy of the current object we now how to prevent this
copy process. We can let the assignment operator return not a copy but the original current object using
a reference.
</p>

<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #66D9EF;">Point</span>&amp; <span style="color: #AE81FF;">Point</span>::<span style="color: #F92672;">operator</span><span style="color: #A6E22E;">=</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">const</span> <span style="color: #66D9EF;">Point</span>&amp; <span style="color: #FD971F;">pt2</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">{</span>
x = pt2.x;
y = pt2.y;
<span style="color: #F92672;">return</span> *<span style="color: #F92672;">this</span>;
<span style="color: #AE81FF;">}</span> <span style="color: #75715E;">// </span><span style="color: #75715E;">It is not mandatory to let an operator= return a reference to the current object it is however advisable to make sure no unnecessary copies are created.</span>
</pre>
</div>
</div></li>
<li><a id="orgheadline119"></a>Example Minimal Functionality<br  /><div class="outline-text-4" id="text-12-2-6">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66D9EF;">class</span> <span style="color: #FD971F;">Point</span>
<span style="color: #AE81FF;">{</span>
<span style="color: #AE81FF;">public</span>:
Point<span style="color: #66D9EF;">()</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">Default constructor</span>
~Point<span style="color: #66D9EF;">()</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">Destructor</span>
Point<span style="color: #66D9EF;">(</span><span style="color: #F92672;">const</span> <span style="color: #66D9EF;">Point</span>&amp; source<span style="color: #66D9EF;">)</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">Copy constructor</span>
Point&amp; operator = <span style="color: #66D9EF;">(</span><span style="color: #F92672;">const</span> <span style="color: #66D9EF;">Point</span>&amp; source<span style="color: #66D9EF;">)</span>; <span style="color: #75715E;">// </span><span style="color: #75715E;">Assignment operator</span>
<span style="color: #AE81FF;">}</span>;
</pre>
</div>
</div></li>
<li><a id="orgheadline120"></a>Kinds of Operator Overloading<br  /><div class="outline-text-4" id="text-12-2-7">
<ul class="org-ul">
<li>Mathematical: +, -, *, /</li>
<li>Array indexing: [ ] (1 dimensional), () (multidimensional)</li>
<li>Function call operator: () (looks just like a C function; called function object/functor)</li>
<li>Relational operators: &lt;, &lt;=, <code>=, !</code>, etc.</li>
<li>Input/output: &lt;&lt;, &gt;&gt;</li>
<li>Exotic operators: , % ^ (if you like…)</li>
</ul>
</div></li></ol>
</div>
