CS/C++/C++.org
** Introducing Friends
- These are functions (or classes) that can directly access the private members of a given class
- Hardly ever use them (bad design), except…
- Binary operators in which first operand has different type than second operand can be declared as friend
- A friend function is NOT a member function

a friend function is a global function and NOT a member function. The function can access all the
members of the objects p1 and p2 but it is not a member function of the class Point. The function
therefore can be placed in any source file, without using the scope resolution operator (::).
#+BEGIN_SRC c
class Point
{
private:
double m_x;
double m_y;
friend void Display(const Point& pt);
};
void Display(const Point& pt)
{
cout << pt.m_x << pt.m_y; // Because it’s a friend function
}
#+END_SRC

#+BEGIN_SRC cpp
class B;
class A
{
private:
int a;
public:
friend class B;
};
class B
{
private:
int b;
public:
void print(const A& obja);
};
void B::print(const A& obja)
{
cout << b;
cout << obja.a;  // object a can accessed by B.
}
#+END_SRC

** Overloaded Operators: Member Versus Nonmember Functions
** More Overloading: A Vector Class
** Automatic Conversions and Type Casts for Classes



* CLASSES AND DYNAMIC MEMORY ALLOCATION
** Dynamic Memory and Classes
- Create memory blocks during run-time
By using a function malloc() we can request a block of memory during run-time. We specify how many bytes we want and the malloc() function allocates it for us and assigns it to our program. The size is the number of bytes we want to allocate. The malloc() function returns the address of the memory we requested. This address must be stored in a variable.

When we use dynamic memory we have to request it using malloc() but we also need to return it to the system when we do not use it anymore. If we do not return it to the system but keep requesting more memory we would run out of memory. The free() function returns the memory to the system.

The function free() does not check if the pointer points to something allocated using malloc(). If the pointer was not initialised using the malloc() function and we would try to free() it, unpredictable errors would occur.
Pointers can store address:
#+BEGIN_SRC c
void main()
{
int* p;
p = (int*) malloc(10*sizeof(int));
if (p != NULL)
{
/* Use the array */
free(p);
}
}
#+END_SRC
- Use malloc() for allocation of block of bytes
- Returns NULL if not enough memory
- Cast return pointer to type*
#+BEGIN_SRC c
(int*)malloc(2*sizeof(int));

#+END_SRC
- Use free() to release allocated memory
#+BEGIN_SRC c
free(p);

#+END_SRC
** A Queue Simulation



* CLASS INHERITANCE
** Beginning with a Simple Base Class
** Inheritance: An Is-a Relationship
** Polymorphic Public Inheritance
** Access Control: protected
** Abstract Base Classes
** Inheritance and Dynamic Memory Allocation
** Class Design Review



* REUSING CODE IN C++
** Classes with Object Members
** Private Inheritance
** Multiple Inheritance
** Class Templates



* FRIENDS, EXCEPTIONS, AND MORE
** Friends
** Nested Classes
** Exceptions
** RTTI
** Type Cast Operators



* THE string CLASS AND THE STANDARD TEMPLATE LIBRARY
** The string Class
** The auto_ptr Class
** The STL
