docs/CS/C++/C++.html
<div id="outline-container-orgheadline122" class="outline-3">
<h3 id="orgheadline122"><span class="section-number-3">12.3</span> Introducing Friends</h3>
<div class="outline-text-3" id="text-12-3">
<ul class="org-ul">
<li>These are functions (or classes) that can directly access the private members of a given class</li>
<li>Hardly ever use them (bad design), except…</li>
<li>Binary operators in which first operand has different type than second operand can be declared as friend</li>
<li>A friend function is NOT a member function</li>
</ul>

<p>
a friend function is a global function and NOT a member function. The function can access all the
members of the objects p1 and p2 but it is not a member function of the class Point. The function
therefore can be placed in any source file, without using the scope resolution operator (::).
</p>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66D9EF;">class</span> <span style="color: #FD971F;">Point</span>
<span style="color: #AE81FF;">{</span>
<span style="color: #AE81FF;">private</span>:
<span style="color: #66D9EF;">double</span> <span style="color: #FD971F;">m_x</span>;
<span style="color: #66D9EF;">double</span> <span style="color: #FD971F;">m_y</span>;
friend <span style="color: #66D9EF;">void</span> <span style="color: #FD971F;">Display</span><span style="color: #66D9EF;">(</span><span style="color: #F92672;">const</span> <span style="color: #66D9EF;">Point</span>&amp; pt<span style="color: #66D9EF;">)</span>;
<span style="color: #AE81FF;">}</span>;
<span style="color: #66D9EF;">void</span> <span style="color: #A6E22E;">Display</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">const</span> <span style="color: #66D9EF;">Point</span>&amp; pt<span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">{</span>
cout &lt;&lt; pt.m_x &lt;&lt; pt.m_y; <span style="color: #75715E;">// </span><span style="color: #75715E;">Because it&#8217;s a friend function</span>
<span style="color: #AE81FF;">}</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #F92672;">class</span> <span style="color: #66D9EF;">B</span>;
<span style="color: #F92672;">class</span> <span style="color: #66D9EF;">A</span>
<span style="color: #AE81FF;">{</span>
<span style="color: #F92672;">private</span>:
<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">a</span>;
<span style="color: #F92672;">public</span>:
<span style="color: #F92672;">friend</span> <span style="color: #F92672;">class</span> <span style="color: #66D9EF;">B</span>;
<span style="color: #AE81FF;">}</span>;
<span style="color: #F92672;">class</span> <span style="color: #66D9EF;">B</span>
<span style="color: #AE81FF;">{</span>
<span style="color: #F92672;">private</span>:
<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">b</span>;
<span style="color: #F92672;">public</span>:
<span style="color: #66D9EF;">void</span> <span style="color: #A6E22E;">print</span><span style="color: #66D9EF;">(</span><span style="color: #F92672;">const</span> <span style="color: #66D9EF;">A</span>&amp; <span style="color: #FD971F;">obja</span><span style="color: #66D9EF;">)</span>;
<span style="color: #AE81FF;">}</span>;
<span style="color: #66D9EF;">void</span> <span style="color: #AE81FF;">B</span>::<span style="color: #A6E22E;">print</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">const</span> <span style="color: #66D9EF;">A</span>&amp; <span style="color: #FD971F;">obja</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">{</span>
cout &lt;&lt; b;
cout &lt;&lt; obja.a;  <span style="color: #75715E;">// </span><span style="color: #75715E;">object a can accessed by B.</span>
<span style="color: #AE81FF;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline123" class="outline-3">
<h3 id="orgheadline123"><span class="section-number-3">12.4</span> Overloaded Operators: Member Versus Nonmember Functions</h3>
</div>
<div id="outline-container-orgheadline124" class="outline-3">
<h3 id="orgheadline124"><span class="section-number-3">12.5</span> More Overloading: A Vector Class</h3>
</div>
<div id="outline-container-orgheadline125" class="outline-3">
<h3 id="orgheadline125"><span class="section-number-3">12.6</span> Automatic Conversions and Type Casts for Classes</h3>
</div>
</div>



<div id="outline-container-orgheadline129" class="outline-2">
<h2 id="orgheadline129"><span class="section-number-2">13</span> CLASSES AND DYNAMIC MEMORY ALLOCATION</h2>
<div class="outline-text-2" id="text-13">
</div><div id="outline-container-orgheadline127" class="outline-3">
<h3 id="orgheadline127"><span class="section-number-3">13.1</span> Dynamic Memory and Classes</h3>
<div class="outline-text-3" id="text-13-1">
<ul class="org-ul">
<li>Create memory blocks during run-time</li>
</ul>
<p>
By using a function malloc() we can request a block of memory during run-time. We specify how many bytes we want and the malloc() function allocates it for us and assigns it to our program. The size is the number of bytes we want to allocate. The malloc() function returns the address of the memory we requested. This address must be stored in a variable.
</p>

<p>
When we use dynamic memory we have to request it using malloc() but we also need to return it to the system when we do not use it anymore. If we do not return it to the system but keep requesting more memory we would run out of memory. The free() function returns the memory to the system.
</p>

<p>
The function free() does not check if the pointer points to something allocated using malloc(). If the pointer was not initialised using the malloc() function and we would try to free() it, unpredictable errors would occur.
Pointers can store address:
</p>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66D9EF;">void</span> <span style="color: #A6E22E;">main</span><span style="color: #AE81FF;">()</span>
<span style="color: #AE81FF;">{</span>
<span style="color: #66D9EF;">int</span>* <span style="color: #FD971F;">p</span>;
p = <span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">int</span>*<span style="color: #66D9EF;">)</span> malloc<span style="color: #66D9EF;">(</span><span style="color: #AE81FF;">10</span>*<span style="color: #F92672;">sizeof</span><span style="color: #A6E22E;">(</span><span style="color: #66D9EF;">int</span><span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>;
<span style="color: #F92672;">if</span> <span style="color: #66D9EF;">(</span>p != <span style="color: #AE81FF;">NULL</span><span style="color: #66D9EF;">)</span>
<span style="color: #66D9EF;">{</span>
<span style="color: #75715E;">/* </span><span style="color: #75715E;">Use the array </span><span style="color: #75715E;">*/</span>
free<span style="color: #A6E22E;">(</span>p<span style="color: #A6E22E;">)</span>;
<span style="color: #66D9EF;">}</span>
<span style="color: #AE81FF;">}</span>
</pre>
</div>
<ul class="org-ul">
<li>Use malloc() for allocation of block of bytes</li>
<li>Returns NULL if not enough memory</li>
<li>Cast return pointer to type*</li>
</ul>
<div class="org-src-container">

<pre class="src src-c"><span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">int</span>*<span style="color: #AE81FF;">)</span>malloc<span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">2</span>*<span style="color: #F92672;">sizeof</span><span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">int</span><span style="color: #66D9EF;">)</span><span style="color: #AE81FF;">)</span>;
</pre>
</div>
<ul class="org-ul">
<li>Use free() to release allocated memory</li>
</ul>
<div class="org-src-container">

<pre class="src src-c">free<span style="color: #AE81FF;">(</span>p<span style="color: #AE81FF;">)</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline128" class="outline-3">
<h3 id="orgheadline128"><span class="section-number-3">13.2</span> A Queue Simulation</h3>
</div>
</div>



<div id="outline-container-orgheadline137" class="outline-2">
<h2 id="orgheadline137"><span class="section-number-2">14</span> CLASS INHERITANCE</h2>
<div class="outline-text-2" id="text-14">
</div><div id="outline-container-orgheadline130" class="outline-3">
<h3 id="orgheadline130"><span class="section-number-3">14.1</span> Beginning with a Simple Base Class</h3>
</div>
<div id="outline-container-orgheadline131" class="outline-3">
<h3 id="orgheadline131"><span class="section-number-3">14.2</span> Inheritance: An Is-a Relationship</h3>
</div>
<div id="outline-container-orgheadline132" class="outline-3">
<h3 id="orgheadline132"><span class="section-number-3">14.3</span> Polymorphic Public Inheritance</h3>
</div>
<div id="outline-container-orgheadline133" class="outline-3">
<h3 id="orgheadline133"><span class="section-number-3">14.4</span> Access Control: protected</h3>
</div>
<div id="outline-container-orgheadline134" class="outline-3">
<h3 id="orgheadline134"><span class="section-number-3">14.5</span> Abstract Base Classes</h3>
</div>
<div id="outline-container-orgheadline135" class="outline-3">
<h3 id="orgheadline135"><span class="section-number-3">14.6</span> Inheritance and Dynamic Memory Allocation</h3>
</div>
<div id="outline-container-orgheadline136" class="outline-3">
<h3 id="orgheadline136"><span class="section-number-3">14.7</span> Class Design Review</h3>
</div>
</div>



<div id="outline-container-orgheadline142" class="outline-2">
<h2 id="orgheadline142"><span class="section-number-2">15</span> REUSING CODE IN C++</h2>
<div class="outline-text-2" id="text-15">
</div><div id="outline-container-orgheadline138" class="outline-3">
<h3 id="orgheadline138"><span class="section-number-3">15.1</span> Classes with Object Members</h3>
</div>
<div id="outline-container-orgheadline139" class="outline-3">
<h3 id="orgheadline139"><span class="section-number-3">15.2</span> Private Inheritance</h3>
</div>
<div id="outline-container-orgheadline140" class="outline-3">
<h3 id="orgheadline140"><span class="section-number-3">15.3</span> Multiple Inheritance</h3>
</div>
<div id="outline-container-orgheadline141" class="outline-3">
<h3 id="orgheadline141"><span class="section-number-3">15.4</span> Class Templates</h3>
</div>
</div>



<div id="outline-container-orgheadline148" class="outline-2">
<h2 id="orgheadline148"><span class="section-number-2">16</span> FRIENDS, EXCEPTIONS, AND MORE</h2>
<div class="outline-text-2" id="text-16">
</div><div id="outline-container-orgheadline143" class="outline-3">
<h3 id="orgheadline143"><span class="section-number-3">16.1</span> Friends</h3>
</div>
<div id="outline-container-orgheadline144" class="outline-3">
<h3 id="orgheadline144"><span class="section-number-3">16.2</span> Nested Classes</h3>
</div>
<div id="outline-container-orgheadline145" class="outline-3">
<h3 id="orgheadline145"><span class="section-number-3">16.3</span> Exceptions</h3>
</div>
<div id="outline-container-orgheadline146" class="outline-3">
<h3 id="orgheadline146"><span class="section-number-3">16.4</span> RTTI</h3>
</div>
<div id="outline-container-orgheadline147" class="outline-3">
<h3 id="orgheadline147"><span class="section-number-3">16.5</span> Type Cast Operators</h3>
</div>
</div>



<div id="outline-container-orgheadline157" class="outline-2">
<h2 id="orgheadline157"><span class="section-number-2">17</span> THE string CLASS AND THE STANDARD TEMPLATE LIBRARY</h2>
<div class="outline-text-2" id="text-17">
</div><div id="outline-container-orgheadline149" class="outline-3">
<h3 id="orgheadline149"><span class="section-number-3">17.1</span> The string Class</h3>
</div>
<div id="outline-container-orgheadline150" class="outline-3">
<h3 id="orgheadline150"><span class="section-number-3">17.2</span> The auto_ptr Class</h3>
</div>
