CS/C++/C++.org
*** vector
- initialising a vector:
#+BEGIN_SRC cpp
// Initializing like arrays
vector<int> vect{ 10, 20, 30 };
// Initializing from array
int arr[] = { 1, 2, 3 };
int n = sizeof(arr) / sizeof(arr[0]);
vector<int> vect(arr, arr + n);

// Initializing by one by one pushing values
vector<int> vect;

vect.push_back(10);
vect.push_back(20);
vect.push_back(30);

for (int x : vect)
    cout << x << " ";

int n = 3;

// Create a vector of size n with
// all values as 10.
vector<int> vect(n, 10);

#+END_SRC
** Generic Programming
** Function Objects (aka Functors)
** Algorithms
** Other Libraries



* INPUT, OUTPUT, AND FILES
** An Overview of C++ Input and Output
*** print
%<flags><field width><.precision><type><format specifier>
** Output with cout
** Input with cin
** File Input and Output
#+BEGIN_SRC c
FILE* fp=fopen(file, mode)
fcose(fp)
#+END_SRC
** Incore Formatting
- String functions are defined in <string.h>
strcmp(), strcpy(), strcat(), etc.
- Character functions defined in <ctype.h>
isalpha(), toupper(),
tolower(), isdigit(), etc.
** What Now?
