docs/CS/C++/C++.html
<div id="outline-container-orgheadline152" class="outline-3">
<h3 id="orgheadline152"><span class="section-number-3">17.3</span> The STL</h3>
<div class="outline-text-3" id="text-17-3">
</div><ol class="org-ol"><li><a id="orgheadline151"></a>vector<br  /><div class="outline-text-4" id="text-17-3-1">
<ul class="org-ul">
<li>initialising a vector:</li>
</ul>
<div class="org-src-container">

<pre class="src src-cpp"><span style="color: #75715E;">// </span><span style="color: #75715E;">Initializing like arrays</span>
<span style="color: #66D9EF;">vector</span><span style="color: #AE81FF;">&lt;</span><span style="color: #66D9EF;">int</span><span style="color: #AE81FF;">&gt;</span> <span style="color: #FD971F;">vect</span><span style="color: #AE81FF;">{</span> <span style="color: #AE81FF;">10</span>, <span style="color: #AE81FF;">20</span>, <span style="color: #AE81FF;">30</span> <span style="color: #AE81FF;">}</span>;
<span style="color: #75715E;">// </span><span style="color: #75715E;">Initializing from array</span>
<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">arr</span><span style="color: #AE81FF;">[]</span> = <span style="color: #AE81FF;">{</span> <span style="color: #AE81FF;">1</span>, <span style="color: #AE81FF;">2</span>, <span style="color: #AE81FF;">3</span> <span style="color: #AE81FF;">}</span>;
<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">n</span> = <span style="color: #F92672;">sizeof</span><span style="color: #AE81FF;">(</span>arr<span style="color: #AE81FF;">)</span> / <span style="color: #F92672;">sizeof</span><span style="color: #AE81FF;">(</span>arr<span style="color: #66D9EF;">[</span><span style="color: #AE81FF;">0</span><span style="color: #66D9EF;">]</span><span style="color: #AE81FF;">)</span>;
<span style="color: #66D9EF;">vector</span><span style="color: #AE81FF;">&lt;</span><span style="color: #66D9EF;">int</span><span style="color: #AE81FF;">&gt;</span> <span style="color: #A6E22E;">vect</span><span style="color: #AE81FF;">(</span>arr, arr + n<span style="color: #AE81FF;">)</span>;

<span style="color: #75715E;">// </span><span style="color: #75715E;">Initializing by one by one pushing values</span>
<span style="color: #66D9EF;">vector</span><span style="color: #AE81FF;">&lt;</span><span style="color: #66D9EF;">int</span><span style="color: #AE81FF;">&gt;</span> <span style="color: #FD971F;">vect</span>;

vect.push_back<span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">10</span><span style="color: #AE81FF;">)</span>;
vect.push_back<span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">20</span><span style="color: #AE81FF;">)</span>;
vect.push_back<span style="color: #AE81FF;">(</span><span style="color: #AE81FF;">30</span><span style="color: #AE81FF;">)</span>;

<span style="color: #F92672;">for</span> <span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">x</span> : vect<span style="color: #AE81FF;">)</span>
    cout &lt;&lt; x &lt;&lt; <span style="color: #E6DB74;">" "</span>;

<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">n</span> = <span style="color: #AE81FF;">3</span>;

<span style="color: #75715E;">// </span><span style="color: #75715E;">Create a vector of size n with</span>
<span style="color: #75715E;">// </span><span style="color: #75715E;">all values as 10.</span>
<span style="color: #66D9EF;">vector</span><span style="color: #AE81FF;">&lt;</span><span style="color: #66D9EF;">int</span><span style="color: #AE81FF;">&gt;</span> <span style="color: #A6E22E;">vect</span><span style="color: #AE81FF;">(</span>n, <span style="color: #AE81FF;">10</span><span style="color: #AE81FF;">)</span>;
</pre>
</div>
</div></li></ol>
</div>
<div id="outline-container-orgheadline153" class="outline-3">
<h3 id="orgheadline153"><span class="section-number-3">17.4</span> Generic Programming</h3>
</div>
<div id="outline-container-orgheadline154" class="outline-3">
<h3 id="orgheadline154"><span class="section-number-3">17.5</span> Function Objects (aka Functors)</h3>
</div>
<div id="outline-container-orgheadline155" class="outline-3">
<h3 id="orgheadline155"><span class="section-number-3">17.6</span> Algorithms</h3>
</div>
<div id="outline-container-orgheadline156" class="outline-3">
<h3 id="orgheadline156"><span class="section-number-3">17.7</span> Other Libraries</h3>
</div>
</div>



<div id="outline-container-orgheadline165" class="outline-2">
<h2 id="orgheadline165"><span class="section-number-2">18</span> INPUT, OUTPUT, AND FILES</h2>
<div class="outline-text-2" id="text-18">
</div><div id="outline-container-orgheadline159" class="outline-3">
<h3 id="orgheadline159"><span class="section-number-3">18.1</span> An Overview of C++ Input and Output</h3>
<div class="outline-text-3" id="text-18-1">
</div><ol class="org-ol"><li><a id="orgheadline158"></a>print<br  /><div class="outline-text-4" id="text-18-1-1">
<p>
%&lt;flags&gt;&lt;field width&gt;&lt;.precision&gt;&lt;type&gt;&lt;format specifier&gt;
</p>
</div></li></ol>
</div>
<div id="outline-container-orgheadline160" class="outline-3">
<h3 id="orgheadline160"><span class="section-number-3">18.2</span> Output with cout</h3>
</div>
<div id="outline-container-orgheadline161" class="outline-3">
<h3 id="orgheadline161"><span class="section-number-3">18.3</span> Input with cin</h3>
</div>
<div id="outline-container-orgheadline162" class="outline-3">
<h3 id="orgheadline162"><span class="section-number-3">18.4</span> File Input and Output</h3>
<div class="outline-text-3" id="text-18-4">
<div class="org-src-container">

<pre class="src src-c"><span style="color: #66D9EF;">FILE</span>* <span style="color: #FD971F;">fp</span>=fopen<span style="color: #AE81FF;">(</span>file, mode<span style="color: #AE81FF;">)</span>
fcose<span style="color: #AE81FF;">(</span>fp<span style="color: #AE81FF;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline163" class="outline-3">
<h3 id="orgheadline163"><span class="section-number-3">18.5</span> Incore Formatting</h3>
<div class="outline-text-3" id="text-18-5">
<ul class="org-ul">
<li>String functions are defined in &lt;string.h&gt;</li>
</ul>
<p>
strcmp(), strcpy(), strcat(), etc.
</p>
<ul class="org-ul">
<li>Character functions defined in &lt;ctype.h&gt;</li>
</ul>
<p>
isalpha(), toupper(),
tolower(), isdigit(), etc.
</p>
</div>
</div>
<div id="outline-container-orgheadline164" class="outline-3">
<h3 id="orgheadline164"><span class="section-number-3">18.6</span> What Now?</h3>
</div>
</div>
</div>
</body>
</html>
